----------------------------------------------------------------------------------------
      name:  combined
       log:  C:\Users\CHENY\Documents\GitHub\thesis-bank/results/robustness_results.log
  log type:  text
 opened on:  18 Dec 2025, 17:50:29

.  
. *------------------------------------------------------
. * 2) Stage 1 robustness: pass-through to deposit pricing and quantities
. *    - Variants: levels vs first-differences; all vs interest-bearing; core share
. *    - Controls: bank FE; quarter FE; region×quarter shares (PC omitted)
. *    - For each block, report joint F-tests of {zS,zR,zH}×cum ΔFFR
. *------------------------------------------------------
. 
. * 2a) Deposit rate (levels): all deposits — cum Δ deposit rate
. reghdfe cum_d_interest_rate_on_deposit ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     28,822
Absorbing 1 HDFE group                            F(  66,   3819) =     366.74
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8666
                                                  Adj R-squared   =     0.8458
                                                  Within R-sq.    =     0.8216
Number of clusters (bankid)  =      3,820         Root MSE        =     0.0027

                                      (Std. err. adjusted for 3,820 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
cum_d_interest_rate~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0002722   .0000309     8.82   0.000     .0002117    .0003327
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0007044   .0000378   -18.65   0.000    -.0007784   -.0006303
                      |
  c.hhi_z#c.cum_d_ffr |  -.0000781   .0000204    -3.84   0.000     -.000118   -.0000382
                      |
                qdate |
                 249  |    -.00091   .0000883   -10.30   0.000    -.0010832   -.0007368
                 250  |  -.0008292   .0001874    -4.42   0.000    -.0011966   -.0004618
                 251  |   .0012596   .0003703     3.40   0.001     .0005336    .0019856
                 252  |   .0044649     .00053     8.42   0.000     .0034257    .0055041
                 253  |    .007926   .0005952    13.32   0.000     .0067591    .0090929
                 254  |   .0103358   .0006684    15.46   0.000     .0090253    .0116462
                 255  |    .011941   .0007247    16.48   0.000     .0105202    .0133619
                      |
           qdate#c.ne |
                 248  |  -.0013509   .0010289    -1.31   0.189    -.0033681    .0006663
                 249  |  -.0013047   .0010275    -1.27   0.204    -.0033192    .0007098
                 250  |  -.0013114    .000909    -1.44   0.149    -.0030935    .0004707
                 251  |  -.0017065   .0007246    -2.36   0.019    -.0031271   -.0002858
                 252  |  -.0010402   .0005629    -1.85   0.065    -.0021438    .0000634
                 253  |  -.0005065   .0004198    -1.21   0.228    -.0013297    .0003166
                 254  |  -.0004449   .0003216    -1.38   0.167    -.0010755    .0001856
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |  -.0028935      .0009    -3.22   0.001     -.004658    -.001129
                 249  |  -.0022858   .0009073    -2.52   0.012    -.0040646   -.0005071
                 250  |  -.0011105   .0007982    -1.39   0.164    -.0026755    .0004544
                 251  |  -.0003992    .000623    -0.64   0.522    -.0016208    .0008223
                 252  |  -.0000261   .0004817    -0.05   0.957    -.0009706    .0009183
                 253  |  -.0003051   .0003641    -0.84   0.402    -.0010189    .0004088
                 254  |  -.0003596   .0002844    -1.26   0.206    -.0009171     .000198
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -.0015695   .0007565    -2.07   0.038    -.0030527   -.0000863
                 249  |  -.0006074   .0007584    -0.80   0.423    -.0020943    .0008795
                 250  |   .0002705     .00066     0.41   0.682    -.0010234    .0015645
                 251  |   .0004833   .0004977     0.97   0.332    -.0004925    .0014591
                 252  |   .0002498   .0003757     0.66   0.506    -.0004868    .0009865
                 253  |  -.0003063   .0002916    -1.05   0.294     -.000878    .0002654
                 254  |  -.0003389    .000211    -1.61   0.108    -.0007526    .0000747
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0027923    .000752    -3.71   0.000    -.0042667   -.0013179
                 249  |  -.0016177   .0007508    -2.15   0.031    -.0030897   -.0001457
                 250  |  -.0004695   .0006493    -0.72   0.470    -.0017426    .0008036
                 251  |   .0000702   .0004867     0.14   0.885     -.000884    .0010244
                 252  |  -.0001948   .0003657    -0.53   0.594    -.0009118    .0005222
                 253  |    -.00073    .000283    -2.58   0.010    -.0012848   -.0001752
                 254  |   -.000468   .0002019    -2.32   0.021    -.0008639   -.0000721
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0024877   .0008151    -3.05   0.002    -.0040858   -.0008896
                 249  |  -.0015662   .0008076    -1.94   0.053    -.0031495    .0000171
                 250  |   -.000673    .000701    -0.96   0.337    -.0020473    .0007014
                 251  |  -.0003703   .0005313    -0.70   0.486     -.001412    .0006715
                 252  |  -.0006109   .0004029    -1.52   0.129    -.0014008    .0001789
                 253  |  -.0006181   .0003107    -1.99   0.047    -.0012272   -8.98e-06
                 254  |  -.0003515   .0002218    -1.58   0.113    -.0007862    .0000833
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0051386    .000828    -6.21   0.000     -.006762   -.0035152
                 249  |   -.003679   .0008121    -4.53   0.000    -.0052712   -.0020868
                 250  |  -.0021751   .0006995    -3.11   0.002    -.0035465   -.0008037
                 251  |  -.0013283   .0005208    -2.55   0.011    -.0023495   -.0003071
                 252  |  -.0008737    .000387    -2.26   0.024    -.0016324    -.000115
                 253  |  -.0011568   .0002993    -3.87   0.000    -.0017435     -.00057
                 254  |  -.0006412   .0002145    -2.99   0.003    -.0010618   -.0002206
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |  -.0044274   .0008028    -5.51   0.000    -.0060015   -.0028534
                 249  |  -.0029618   .0007896    -3.75   0.000    -.0045098   -.0014137
                 250  |  -.0014694   .0006785    -2.17   0.030    -.0027996   -.0001392
                 251  |  -.0007494   .0005093    -1.47   0.141    -.0017479    .0002491
                 252  |  -.0005432   .0003829    -1.42   0.156    -.0012939    .0002076
                 253  |  -.0007603   .0002946    -2.58   0.010    -.0013378   -.0001827
                 254  |  -.0005011   .0002085    -2.40   0.016      -.00091   -.0000923
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |   .0001454   .0008836     0.16   0.869    -.0015871    .0018778
                 249  |   .0006851   .0008715     0.79   0.432    -.0010236    .0023938
                 250  |   .0013294   .0007698     1.73   0.084    -.0001798    .0028386
                 251  |   .0012146    .000605     2.01   0.045     .0000285    .0024008
                 252  |   .0004237   .0004696     0.90   0.367     -.000497    .0013444
                 253  |   .0000752   .0003768     0.20   0.842    -.0006636     .000814
                 254  |  -.0000697   .0002678    -0.26   0.795    -.0005948    .0004555
                 255  |          0  (omitted)
                      |
                _cons |   .0025373   .0007165     3.54   0.000     .0011325     .003942
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  3819) =  227.91
            Prob > F =    0.0000

. 
. reghdfe cum_d_interest_rate_on_interest_ ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     28,822
Absorbing 1 HDFE group                            F(  66,   3819) =     446.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8806
                                                  Adj R-squared   =     0.8620
                                                  Within R-sq.    =     0.8432
Number of clusters (bankid)  =      3,820         Root MSE        =     0.0033

                                      (Std. err. adjusted for 3,820 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
cum_d_interest_rate~_ | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0003552   .0000367     9.68   0.000     .0002833    .0004272
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0008311   .0000471   -17.63   0.000    -.0009236   -.0007387
                      |
  c.hhi_z#c.cum_d_ffr |  -.0001121   .0000249    -4.49   0.000     -.000161   -.0000631
                      |
                qdate |
                 249  |  -.0008951   .0001209    -7.40   0.000    -.0011322    -.000658
                 250  |  -.0006173   .0002207    -2.80   0.005      -.00105   -.0001847
                 251  |   .0026312   .0004439     5.93   0.000     .0017608    .0035016
                 252  |    .007136   .0006275    11.37   0.000     .0059057    .0083663
                 253  |   .0117792   .0006769    17.40   0.000     .0104522    .0131063
                 254  |   .0150231   .0007371    20.38   0.000     .0135779    .0164684
                 255  |   .0171353   .0007723    22.19   0.000     .0156212    .0186495
                      |
           qdate#c.ne |
                 248  |   .0005516   .0011768     0.47   0.639    -.0017556    .0028588
                 249  |      .0004   .0011693     0.34   0.732    -.0018925    .0026926
                 250  |   .0002564   .0010349     0.25   0.804    -.0017727    .0022854
                 251  |  -.0007821   .0008315    -0.94   0.347    -.0024123     .000848
                 252  |  -.0005308   .0006487    -0.82   0.413    -.0018027     .000741
                 253  |  -.0003111   .0004625    -0.67   0.501    -.0012178    .0005957
                 254  |  -.0003793   .0003712    -1.02   0.307    -.0011071    .0003486
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |  -.0017251   .0009892    -1.74   0.081    -.0036645    .0002144
                 249  |  -.0010837   .0009913    -1.09   0.274    -.0030272    .0008598
                 250  |   .0002408    .000874     0.28   0.783    -.0014726    .0019543
                 251  |   .0007264   .0006827     1.06   0.287    -.0006121     .002065
                 252  |   .0006492    .000541     1.20   0.230    -.0004116    .0017099
                 253  |   5.08e-06   .0004076     0.01   0.990     -.000794    .0008042
                 254  |  -.0002626   .0003179    -0.83   0.409    -.0008859    .0003608
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -5.66e-06   .0008143    -0.01   0.994    -.0016022    .0015909
                 249  |   .0009673   .0008117     1.19   0.234    -.0006242    .0025588
                 250  |   .0019544   .0007042     2.78   0.006     .0005738     .003335
                 251  |   .0017361   .0005261     3.30   0.001     .0007046    .0027677
                 252  |    .001036   .0004174     2.48   0.013     .0002176    .0018544
                 253  |   .0000141    .000318     0.04   0.965    -.0006094    .0006376
                 254  |  -.0002862   .0002388    -1.20   0.231    -.0007544     .000182
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0014577   .0008093    -1.80   0.072    -.0030443     .000129
                 249  |  -.0002545   .0008017    -0.32   0.751    -.0018263    .0013173
                 250  |   .0010555   .0006899     1.53   0.126    -.0002971    .0024082
                 251  |   .0012463   .0005114     2.44   0.015     .0002437    .0022488
                 252  |   .0004987   .0004044     1.23   0.218    -.0002941    .0012915
                 253  |  -.0005204   .0003067    -1.70   0.090    -.0011216    .0000809
                 254  |  -.0004658   .0002268    -2.05   0.040    -.0009105   -.0000212
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0026962   .0008946    -3.01   0.003    -.0044502   -.0009422
                 249  |  -.0017301   .0008813    -1.96   0.050    -.0034579   -2.26e-06
                 250  |  -.0005853   .0007629    -0.77   0.443    -.0020809    .0009104
                 251  |  -.0004737   .0005738    -0.83   0.409    -.0015987    .0006512
                 252  |  -.0008982    .000455    -1.97   0.048    -.0017903   -6.09e-06
                 253  |   -.000738   .0003487    -2.12   0.034    -.0014216   -.0000544
                 254  |  -.0004176   .0002582    -1.62   0.106    -.0009238    .0000885
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |   -.004954   .0009024    -5.49   0.000    -.0067233   -.0031847
                 249  |  -.0033136   .0008763    -3.78   0.000    -.0050317   -.0015956
                 250  |  -.0015199   .0007511    -2.02   0.043    -.0029924   -.0000473
                 251  |  -.0009286   .0005528    -1.68   0.093    -.0020124    .0001551
                 252  |  -.0006223   .0004317    -1.44   0.150    -.0014688    .0002242
                 253  |  -.0011632   .0003278    -3.55   0.000    -.0018059   -.0005205
                 254  |  -.0006333   .0002457    -2.58   0.010     -.001115   -.0001516
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |  -.0051741   .0008742    -5.92   0.000    -.0068881   -.0034601
                 249  |  -.0035386   .0008527    -4.15   0.000    -.0052103   -.0018669
                 250  |  -.0015657   .0007298    -2.15   0.032    -.0029965   -.0001348
                 251  |  -.0008413   .0005433    -1.55   0.122    -.0019064    .0002239
                 252  |  -.0006788   .0004291    -1.58   0.114    -.0015201    .0001625
                 253  |  -.0009264   .0003246    -2.85   0.004    -.0015628   -.0002899
                 254  |  -.0006257   .0002373    -2.64   0.008    -.0010909   -.0001605
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |   .0007562   .0010083     0.75   0.453    -.0012206     .002733
                 249  |    .001228   .0009816     1.25   0.211    -.0006965    .0031526
                 250  |   .0018739   .0008766     2.14   0.033     .0001553    .0035926
                 251  |   .0014364   .0006983     2.06   0.040     .0000673    .0028055
                 252  |   .0003035   .0005694     0.53   0.594    -.0008128    .0014198
                 253  |  -.0001265   .0004488    -0.28   0.778    -.0010063    .0007534
                 254  |  -.0001494   .0003352    -0.45   0.656    -.0008065    .0005077
                 255  |          0  (omitted)
                      |
                _cons |   .0018215   .0007661     2.38   0.017     .0003194    .0033236
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  3819) =  224.08
            Prob > F =    0.0000

. 
. * 2d) Deposit rate (first-difference): all deposits — Δ deposit rate
. reghdfe d_interest_rate_on_deposit ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 43 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     30,657
Absorbing 1 HDFE group                            F(  68,   4142) =     357.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6106
                                                  Adj R-squared   =     0.5486
                                                  Within R-sq.    =     0.4992
Number of clusters (bankid)  =      4,143         Root MSE        =     0.0014

                                      (Std. err. adjusted for 4,143 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
d_interest_rate_on_~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |    .000069   .0000114     6.03   0.000     .0000465    .0000914
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0000783   8.85e-06    -8.84   0.000    -.0000956   -.0000609
                      |
  c.hhi_z#c.cum_d_ffr |  -.0000203   4.98e-06    -4.07   0.000      -.00003   -.0000105
                      |
        c.metro_dummy#|
          c.cum_d_ffr |   .0000286   .0000135     2.11   0.035     2.02e-06    .0000551
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |  -.0000311    .000011    -2.83   0.005    -.0000527   -9.57e-06
                      |
                qdate |
                 249  |   .0001869   .0000369     5.06   0.000     .0001145    .0002592
                 250  |   .0011859   .0001218     9.73   0.000      .000947    .0014247
                 251  |   .0028677   .0002318    12.37   0.000     .0024132    .0033222
                 252  |   .0033363   .0002157    15.47   0.000     .0029133    .0037592
                 253  |   .0032819   .0001482    22.15   0.000     .0029913    .0035724
                 254  |   .0021995   .0001517    14.50   0.000      .001902    .0024969
                 255  |   .0016524   .0001456    11.35   0.000      .001367    .0019379
                      |
           qdate#c.ne |
                 248  |  -.0003213   .0002156    -1.49   0.136     -.000744    .0001014
                 249  |  -.0001805   .0002058    -0.88   0.381     -.000584    .0002231
                 250  |  -.0003002   .0002493    -1.20   0.229    -.0007891    .0001886
                 251  |  -.0006355   .0003332    -1.91   0.057    -.0012887    .0000176
                 252  |    .000194   .0003585     0.54   0.588    -.0005088    .0008968
                 253  |   .0002339   .0002903     0.81   0.420    -.0003352    .0008031
                 254  |    .000085   .0002192     0.39   0.698    -.0003447    .0005148
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |  -.0005016   .0002226    -2.25   0.024     -.000938   -.0000651
                 249  |  -.0001997   .0002142    -0.93   0.351    -.0006197    .0002202
                 250  |   .0002661   .0002537     1.05   0.294    -.0002313    .0007636
                 251  |   .0001633   .0003238     0.50   0.614    -.0004716    .0007981
                 252  |  -.0000963   .0003028    -0.32   0.751    -.0006898    .0004973
                 253  |  -.0003245   .0002732    -1.19   0.235    -.0008602    .0002111
                 254  |  -6.19e-06    .000229    -0.03   0.978    -.0004551    .0004427
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -.0005409   .0001594    -3.39   0.001    -.0008533   -.0002285
                 249  |  -.0004125   .0001469    -2.81   0.005    -.0007005   -.0001245
                 250  |  -.0005192   .0001559    -3.33   0.001    -.0008249   -.0002136
                 251  |  -.0009003   .0002238    -4.02   0.000    -.0013391   -.0004615
                 252  |  -.0006992   .0002175    -3.21   0.001    -.0011257   -.0002728
                 253  |  -.0006881   .0001789    -3.85   0.000    -.0010389   -.0003374
                 254  |   -.000105   .0001595    -0.66   0.510    -.0004178    .0002077
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0007245   .0001555    -4.66   0.000    -.0010295   -.0004196
                 249  |  -.0005609   .0001404    -3.99   0.000    -.0008362   -.0002856
                 250  |  -.0005546   .0001477    -3.75   0.000    -.0008442    -.000265
                 251  |  -.0008618   .0002162    -3.99   0.000    -.0012858   -.0004379
                 252  |  -.0008258   .0002087    -3.96   0.000    -.0012349   -.0004167
                 253  |  -.0007906   .0001672    -4.73   0.000    -.0011184   -.0004628
                 254  |  -.0000211   .0001516    -0.14   0.889    -.0003184    .0002761
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0006431   .0001692    -3.80   0.000    -.0009748   -.0003114
                 249  |  -.0005015   .0001599    -3.14   0.002     -.000815   -.0001881
                 250  |  -.0005222   .0001752    -2.98   0.003    -.0008656   -.0001787
                 251  |  -.0008609   .0002462    -3.50   0.000    -.0013437   -.0003782
                 252  |  -.0007299   .0002333    -3.13   0.002    -.0011873   -.0002725
                 253  |  -.0001677   .0002004    -0.84   0.403    -.0005606    .0002253
                 254  |   .0001359   .0001687     0.81   0.421    -.0001949    .0004666
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0011779   .0001728    -6.82   0.000    -.0015167    -.000839
                 249  |  -.0009695   .0001592    -6.09   0.000    -.0012816   -.0006574
                 250  |  -.0010656   .0001681    -6.34   0.000    -.0013952   -.0007361
                 251  |  -.0010714   .0002405    -4.46   0.000    -.0015428      -.0006
                 252  |  -.0005482   .0002334    -2.35   0.019    -.0010057   -.0000906
                 253  |   -.000756   .0001858    -4.07   0.000    -.0011202   -.0003918
                 254  |   .0001034    .000177     0.58   0.559    -.0002437    .0004505
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |  -.0009775    .000164    -5.96   0.000     -.001299    -.000656
                 249  |   -.000719     .00015    -4.79   0.000    -.0010131    -.000425
                 250  |  -.0005814   .0001566    -3.71   0.000    -.0008884   -.0002743
                 251  |   -.000851    .000225    -3.78   0.000    -.0012921   -.0004098
                 252  |   -.000525   .0002206    -2.38   0.017    -.0009575   -.0000926
                 253  |  -.0005591    .000177    -3.16   0.002    -.0009061   -.0002121
                 254  |   .0000344   .0001587     0.22   0.829    -.0002768    .0003456
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |  -.0003328   .0002089    -1.59   0.111    -.0007424    .0000768
                 249  |  -.0001717   .0001979    -0.87   0.386    -.0005597    .0002163
                 250  |  -.0000468   .0002921    -0.16   0.873    -.0006195    .0005259
                 251  |  -.0007277   .0003044    -2.39   0.017    -.0013246   -.0001308
                 252  |  -.0009414   .0002754    -3.42   0.001    -.0014814   -.0004014
                 253  |  -.0001922   .0002533    -0.76   0.448    -.0006888    .0003045
                 254  |   .0001946   .0002266     0.86   0.391    -.0002498    .0006389
                 255  |          0  (omitted)
                      |
                _cons |   .0004446   .0001411     3.15   0.002     .0001679    .0007213
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      4143        4143           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  4142) =   50.96
            Prob > F =    0.0000

. 
. reghdfe d_interest_rate_on_interest_bear ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 43 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     30,657
Absorbing 1 HDFE group                            F(  68,   4142) =     423.16
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5909
                                                  Adj R-squared   =     0.5258
                                                  Within R-sq.    =     0.4901
Number of clusters (bankid)  =      4,143         Root MSE        =     0.0018

                                      (Std. err. adjusted for 4,143 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
d_interest_rate_on_~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0000748   .0000143     5.22   0.000     .0000467    .0001029
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0000673   .0000105    -6.43   0.000    -.0000878   -.0000468
                      |
  c.hhi_z#c.cum_d_ffr |  -.0000228   6.28e-06    -3.62   0.000    -.0000351   -.0000104
                      |
        c.metro_dummy#|
          c.cum_d_ffr |   .0000449   .0000164     2.73   0.006     .0000127    .0000771
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |  -.0000329   .0000136    -2.41   0.016    -.0000597   -6.18e-06
                      |
                qdate |
                 249  |   .0004026   .0000612     6.58   0.000     .0002826    .0005227
                 250  |   .0019424   .0001716    11.32   0.000      .001606    .0022788
                 251  |   .0043536   .0002927    14.87   0.000     .0037797    .0049276
                 252  |   .0048512   .0002706    17.93   0.000     .0043208    .0053817
                 253  |   .0047644   .0002055    23.18   0.000     .0043615    .0051673
                 254  |   .0031671   .0001994    15.88   0.000     .0027761     .003558
                 255  |   .0022279   .0001835    12.14   0.000     .0018681    .0025878
                      |
           qdate#c.ne |
                 248  |  -.0001762   .0002736    -0.64   0.520    -.0007126    .0003602
                 249  |  -.0001361   .0002688    -0.51   0.613    -.0006631    .0003909
                 250  |  -.0004864   .0003577    -1.36   0.174    -.0011877    .0002149
                 251  |  -.0011594   .0004703    -2.47   0.014    -.0020814   -.0002375
                 252  |  -.0002365   .0004821    -0.49   0.624    -.0011817    .0007088
                 253  |  -.0002304   .0004027    -0.57   0.567      -.00102    .0005591
                 254  |  -.0001216   .0003073    -0.40   0.692    -.0007239    .0004808
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |  -.0004075   .0002742    -1.49   0.137    -.0009451    .0001301
                 249  |  -.0001422   .0002674    -0.53   0.595    -.0006664     .000382
                 250  |   .0002793    .000351     0.80   0.426    -.0004089    .0009675
                 251  |  -.0000969   .0004434    -0.22   0.827    -.0009662    .0007724
                 252  |   -.000501   .0004048    -1.24   0.216    -.0012946    .0002926
                 253  |  -.0009369   .0003566    -2.63   0.009     -.001636   -.0002379
                 254  |  -.0002437   .0003063    -0.80   0.426    -.0008442    .0003568
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |   -.000428    .000199    -2.15   0.032    -.0008182   -.0000378
                 249  |  -.0004112   .0001863    -2.21   0.027    -.0007764    -.000046
                 250  |  -.0007709   .0002318    -3.33   0.001    -.0012253   -.0003165
                 251  |  -.0014833   .0003244    -4.57   0.000    -.0021193   -.0008473
                 252  |  -.0012023   .0003094    -3.89   0.000    -.0018089   -.0005957
                 253  |   -.001297   .0002634    -4.92   0.000    -.0018135   -.0007805
                 254  |  -.0003385    .000234    -1.45   0.148    -.0007973    .0001204
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0006905    .000196    -3.52   0.000    -.0010747   -.0003062
                 249  |  -.0006701   .0001789    -3.74   0.000    -.0010209   -.0003192
                 250  |  -.0009052   .0002226    -4.07   0.000    -.0013416   -.0004689
                 251  |  -.0015006   .0003156    -4.76   0.000    -.0021193   -.0008819
                 252  |  -.0014461   .0002992    -4.83   0.000    -.0020328   -.0008594
                 253  |  -.0015057    .000252    -5.97   0.000    -.0019997   -.0010116
                 254  |  -.0003281   .0002263    -1.45   0.147    -.0007717    .0001155
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0006795   .0002144    -3.17   0.002    -.0010999   -.0002591
                 249  |  -.0006405   .0002076    -3.08   0.002    -.0010476   -.0002334
                 250  |  -.0008021   .0002613    -3.07   0.002    -.0013144   -.0002898
                 251  |  -.0013423   .0003582    -3.75   0.000    -.0020445     -.00064
                 252  |  -.0010731   .0003352    -3.20   0.001    -.0017302   -.0004161
                 253  |  -.0002972   .0002962    -1.00   0.316    -.0008779    .0002836
                 254  |   .0001183   .0002539     0.47   0.641    -.0003796    .0006161
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0012383   .0002163    -5.72   0.000    -.0016624   -.0008142
                 249  |  -.0011166   .0002034    -5.49   0.000    -.0015154   -.0007178
                 250  |    -.00148   .0002468    -6.00   0.000    -.0019639   -.0009962
                 251  |   -.001746   .0003457    -5.05   0.000    -.0024238   -.0010682
                 252  |  -.0009535   .0003304    -2.89   0.004    -.0016013   -.0003057
                 253  |  -.0012726    .000273    -4.66   0.000    -.0018078   -.0007373
                 254  |   1.65e-06   .0002582     0.01   0.995    -.0005047     .000508
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |  -.0011007   .0002055    -5.36   0.000    -.0015037   -.0006978
                 249  |  -.0009032   .0001926    -4.69   0.000    -.0012808   -.0005256
                 250  |  -.0008021   .0002362    -3.40   0.001    -.0012653    -.000339
                 251  |   -.001272   .0003289    -3.87   0.000    -.0019168   -.0006273
                 252  |  -.0008073   .0003178    -2.54   0.011    -.0014303   -.0001842
                 253  |  -.0009221   .0002662    -3.46   0.001     -.001444   -.0004001
                 254  |  -.0000533   .0002381    -0.22   0.823    -.0005201    .0004134
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |  -.0004323   .0002768    -1.56   0.118    -.0009749    .0001103
                 249  |  -.0003703    .000265    -1.40   0.162    -.0008898    .0001492
                 250  |  -.0004241   .0003776    -1.12   0.262    -.0011645    .0003163
                 251  |  -.0013381   .0004328    -3.09   0.002    -.0021866   -.0004896
                 252  |  -.0014712   .0003925    -3.75   0.000    -.0022407   -.0007018
                 253  |  -.0005717   .0003666    -1.56   0.119    -.0012904     .000147
                 254  |   .0000676   .0003324     0.20   0.839    -.0005841    .0007194
                 255  |          0  (omitted)
                      |
                _cons |   .0003692   .0001762     2.10   0.036     .0000237    .0007146
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      4143        4143           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  4142) =   32.39
            Prob > F =    0.0000

. 
. * 2e) Deposit quantity (first-difference): average deposits
. reghdfe d_core_deposit ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 43 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     30,657
Absorbing 1 HDFE group                            F(  66,   4142) =      24.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1995
                                                  Adj R-squared   =     0.0721
                                                  Within R-sq.    =     0.0567
Number of clusters (bankid)  =      4,143         Root MSE        =     0.0557

                                      (Std. err. adjusted for 4,143 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
       d_core_deposit | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0005571   .0002731     2.04   0.041     .0000216    .0010926
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0009152    .000273    -3.35   0.001    -.0014504     -.00038
                      |
  c.hhi_z#c.cum_d_ffr |    .000364   .0002005     1.82   0.070    -.0000292    .0007571
                      |
                qdate |
                 249  |  -.0106111    .006694    -1.59   0.113    -.0237349    .0025126
                 250  |  -.0061226   .0066134    -0.93   0.355    -.0190883    .0068431
                 251  |  -.0435346   .0074631    -5.83   0.000    -.0581662    -.028903
                 252  |   -.037543   .0079059    -4.75   0.000    -.0530429   -.0220432
                 253  |  -.0176766   .0067319    -2.63   0.009    -.0308748   -.0044784
                 254  |  -.0112346   .0071834    -1.56   0.118     -.025318    .0028487
                 255  |  -.0225745   .0072439    -3.12   0.002    -.0367765   -.0083725
                      |
           qdate#c.ne |
                 248  |   .0142637   .0118664     1.20   0.229    -.0090008    .0375281
                 249  |   .0022736   .0106987     0.21   0.832    -.0187017    .0232488
                 250  |  -.0035314   .0097272    -0.36   0.717    -.0226019    .0155392
                 251  |   .0102874   .0097082     1.06   0.289    -.0087459    .0293207
                 252  |   .0118277   .0118509     1.00   0.318    -.0114063    .0350618
                 253  |  -.0079083   .0099876    -0.79   0.429    -.0274893    .0116726
                 254  |   .0102753   .0115878     0.89   0.375     -.012443    .0329936
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |    .010206   .0097165     1.05   0.294    -.0088437    .0292556
                 249  |   -.010207   .0089718    -1.14   0.255    -.0277966    .0073826
                 250  |   -.001394   .0090224    -0.15   0.877    -.0190829    .0162948
                 251  |   .0068191     .00877     0.78   0.437    -.0103747     .024013
                 252  |   .0289929   .0094482     3.07   0.002     .0104694    .0475164
                 253  |  -.0079461   .0087064    -0.91   0.361    -.0250154    .0091232
                 254  |   .0054178   .0095927     0.56   0.572     -.013389    .0242246
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -.0051307   .0078004    -0.66   0.511    -.0204236    .0101622
                 249  |  -.0175714   .0066586    -2.64   0.008    -.0306259   -.0045169
                 250  |  -.0220515   .0069834    -3.16   0.002    -.0357428   -.0083603
                 251  |   .0068766   .0068391     1.01   0.315    -.0065318     .020285
                 252  |    .006039   .0070583     0.86   0.392     -.007799     .019877
                 253  |  -.0175216   .0069546    -2.52   0.012    -.0311563   -.0038869
                 254  |  -.0141488   .0074174    -1.91   0.057    -.0286908    .0003932
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0052691   .0077555    -0.68   0.497    -.0204741    .0099358
                 249  |   -.027765   .0065439    -4.24   0.000    -.0405946   -.0149354
                 250  |  -.0387383   .0068314    -5.67   0.000    -.0521316   -.0253451
                 251  |   .0030283   .0067588     0.45   0.654    -.0102227    .0162792
                 252  |  -.0040291   .0070466    -0.57   0.568    -.0178443     .009786
                 253  |  -.0363944   .0067544    -5.39   0.000    -.0496366   -.0231522
                 254  |  -.0293526    .007269    -4.04   0.000    -.0436037   -.0151014
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |   .0159752     .00843     1.90   0.058    -.0005521    .0325026
                 249  |   .0017051   .0072891     0.23   0.815    -.0125855    .0159957
                 250  |  -.0133864   .0077182    -1.73   0.083    -.0285182    .0017454
                 251  |   .0119382   .0074592     1.60   0.110    -.0026858    .0265622
                 252  |    .012599    .007637     1.65   0.099    -.0023736    .0275716
                 253  |   -.010278   .0072537    -1.42   0.157    -.0244992    .0039431
                 254  |  -.0116129   .0078609    -1.48   0.140    -.0270244    .0037987
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0023318   .0084351    -0.28   0.782    -.0188691    .0142055
                 249  |  -.0110031    .007321    -1.50   0.133    -.0253561    .0033499
                 250  |  -.0248638   .0073601    -3.38   0.001    -.0392936    -.010434
                 251  |   .0030846   .0073126     0.42   0.673    -.0112519    .0174212
                 252  |    .015067   .0075381     2.00   0.046     .0002883    .0298456
                 253  |  -.0164348   .0072705    -2.26   0.024    -.0306888   -.0021807
                 254  |  -.0111523   .0077338    -1.44   0.149    -.0263147    .0040102
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |   -.003799   .0081259    -0.47   0.640      -.01973    .0121321
                 249  |  -.0104176   .0069536    -1.50   0.134    -.0240504    .0032153
                 250  |  -.0181453   .0071618    -2.53   0.011    -.0321863   -.0041042
                 251  |   .0059307   .0071324     0.83   0.406    -.0080526     .019914
                 252  |  -.0008279   .0072901    -0.11   0.910    -.0151204    .0134646
                 253  |  -.0254019   .0070533    -3.60   0.000      -.03923   -.0115737
                 254  |  -.0157178   .0075487    -2.08   0.037    -.0305173   -.0009182
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |   .0003417   .0102035     0.03   0.973    -.0196627    .0203461
                 249  |   -.009522   .0088794    -1.07   0.284    -.0269303    .0078864
                 250  |  -.0050219   .0091041    -0.55   0.581    -.0228708     .012827
                 251  |   .0055661   .0087936     0.63   0.527    -.0116741    .0228063
                 252  |  -.0029599   .0098583    -0.30   0.764    -.0222875    .0163677
                 253  |  -.0241038   .0095316    -2.53   0.011    -.0427909   -.0054166
                 254  |   .0010605   .0102262     0.10   0.917    -.0189883    .0211093
                 255  |          0  (omitted)
                      |
                _cons |   .0320269   .0071908     4.45   0.000      .017929    .0461247
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      4143        4143           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  4142) =    7.68
            Prob > F =    0.0000

. 
. * 2f) Deposit quantity (first-difference): interest-bearing deposits
. reghdfe d_average_deposit ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 43 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     30,657
Absorbing 1 HDFE group                            F(  68,   4142) =      26.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2291
                                                  Adj R-squared   =     0.1063
                                                  Within R-sq.    =     0.0689
Number of clusters (bankid)  =      4,143         Root MSE        =     0.0464

                                      (Std. err. adjusted for 4,143 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
    d_average_deposit | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0010407   .0003775     2.76   0.006     .0003006    .0017808
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0011763    .000242    -4.86   0.000    -.0016507   -.0007019
                      |
  c.hhi_z#c.cum_d_ffr |   .0003047   .0001763     1.73   0.084     -.000041    .0006504
                      |
        c.metro_dummy#|
          c.cum_d_ffr |   .0014344     .00045     3.19   0.001     .0005522    .0023167
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |  -.0008115   .0003493    -2.32   0.020    -.0014964   -.0001266
                      |
                qdate |
                 249  |  -.0124728   .0054336    -2.30   0.022    -.0231255   -.0018201
                 250  |  -.0028978    .005338    -0.54   0.587     -.013363    .0075675
                 251  |  -.0329441   .0065264    -5.05   0.000    -.0457392   -.0201489
                 252  |  -.0306589   .0066805    -4.59   0.000    -.0437564   -.0175615
                 253  |  -.0199618     .00551    -3.62   0.000    -.0307643   -.0091594
                 254  |  -.0106997   .0052254    -2.05   0.041    -.0209443   -.0004551
                 255  |  -.0310096   .0056935    -5.45   0.000     -.042172   -.0198472
                      |
           qdate#c.ne |
                 248  |  -.0006114    .009142    -0.07   0.947    -.0185347    .0173119
                 249  |   -.009267   .0090959    -1.02   0.308    -.0270999    .0085659
                 250  |  -.0142478   .0090047    -1.58   0.114    -.0319018    .0034062
                 251  |   .0008967    .008036     0.11   0.911    -.0148581    .0166516
                 252  |   .0041428   .0099904     0.41   0.678    -.0154436    .0237293
                 253  |  -.0088879   .0073463    -1.21   0.226    -.0232906    .0055147
                 254  |  -.0077233   .0077905    -0.99   0.322    -.0229968    .0075501
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |   .0061884   .0079847     0.78   0.438     -.009466    .0218427
                 249  |  -.0128317   .0065563    -1.96   0.050    -.0256857    .0000222
                 250  |  -.0044925   .0075775    -0.59   0.553    -.0193484    .0103635
                 251  |  -.0070804   .0063732    -1.11   0.267    -.0195754    .0054145
                 252  |   .0192238   .0080251     2.40   0.017     .0034904    .0349572
                 253  |  -.0143043   .0067151    -2.13   0.033    -.0274694   -.0011391
                 254  |   .0017643   .0075329     0.23   0.815    -.0130041    .0165328
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -.0100386   .0060626    -1.66   0.098    -.0219245    .0018472
                 249  |  -.0239063   .0050332    -4.75   0.000     -.033774   -.0140386
                 250  |  -.0289818   .0058485    -4.96   0.000    -.0404481   -.0175155
                 251  |  -.0081938    .004977    -1.65   0.100    -.0179514    .0015638
                 252  |   -.003635   .0061002    -0.60   0.551    -.0155946    .0083247
                 253  |  -.0232646   .0052704    -4.41   0.000    -.0335975   -.0129317
                 254  |  -.0201787   .0050224    -4.02   0.000    -.0300254    -.010332
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0142642   .0060824    -2.35   0.019    -.0261891   -.0023393
                 249  |  -.0368294   .0049435    -7.45   0.000    -.0465214   -.0271374
                 250  |  -.0520587   .0057317    -9.08   0.000     -.063296   -.0408215
                 251  |  -.0126549   .0049146    -2.57   0.010    -.0222901   -.0030197
                 252  |  -.0162131   .0060948    -2.66   0.008    -.0281622   -.0042641
                 253  |  -.0435034   .0051359    -8.47   0.000    -.0535725   -.0334342
                 254  |  -.0422406   .0048868    -8.64   0.000    -.0518214   -.0326598
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0002221    .006608    -0.03   0.973    -.0131773    .0127331
                 249  |    -.01736   .0055808    -3.11   0.002    -.0283013   -.0064187
                 250  |  -.0353411   .0063904    -5.53   0.000    -.0478697   -.0228126
                 251  |   -.006261   .0055653    -1.12   0.261     -.017172      .00465
                 252  |  -.0060435    .006643    -0.91   0.363    -.0190674    .0069803
                 253  |  -.0226537   .0056002    -4.05   0.000    -.0336331   -.0116743
                 254  |  -.0305309   .0054175    -5.64   0.000     -.041152   -.0199097
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0116292   .0065912    -1.76   0.078    -.0245516    .0012931
                 249  |  -.0234059   .0056122    -4.17   0.000    -.0344087   -.0124031
                 250  |  -.0430112   .0060062    -7.16   0.000    -.0547866   -.0312358
                 251  |  -.0117799   .0053272    -2.21   0.027     -.022224   -.0013358
                 252  |  -.0006792   .0064279    -0.11   0.916    -.0132813    .0119228
                 253  |  -.0304967   .0054539    -5.59   0.000    -.0411894   -.0198041
                 254  |  -.0271008   .0051744    -5.24   0.000    -.0372455   -.0169561
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |  -.0173472   .0063594    -2.73   0.006     -.029815   -.0048794
                 249  |  -.0269062   .0053675    -5.01   0.000    -.0374293   -.0163831
                 250  |  -.0369304   .0059712    -6.18   0.000    -.0486371   -.0252238
                 251  |  -.0105759   .0052257    -2.02   0.043     -.020821   -.0003307
                 252  |  -.0147129   .0063293    -2.32   0.020    -.0271218    -.002304
                 253  |  -.0372422   .0054614    -6.82   0.000    -.0479494   -.0265349
                 254  |  -.0319921   .0051155    -6.25   0.000    -.0420212   -.0219631
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |  -.0138346   .0083622    -1.65   0.098    -.0302291    .0025598
                 249  |   -.017196   .0072269    -2.38   0.017    -.0313645   -.0030275
                 250  |  -.0221725   .0075788    -2.93   0.003    -.0370311    -.007314
                 251  |  -.0149164   .0069475    -2.15   0.032    -.0285373   -.0012955
                 252  |  -.0231369   .0085787    -2.70   0.007    -.0399557   -.0063181
                 253  |  -.0301331   .0078648    -3.83   0.000    -.0455523   -.0147138
                 254  |  -.0165389    .007919    -2.09   0.037    -.0320643   -.0010134
                 255  |          0  (omitted)
                      |
                _cons |   .0413913   .0055204     7.50   0.000     .0305683    .0522143
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      4143        4143           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  4142) =   12.91
            Prob > F =    0.0000

. 
. * 2g) Deposit composition (first-difference): core deposit share
. reghdfe d_average_interest_bearing_depos ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 43 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     30,657
Absorbing 1 HDFE group                            F(  68,   4142) =      17.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2122
                                                  Adj R-squared   =     0.0868
                                                  Within R-sq.    =     0.0455
Number of clusters (bankid)  =      4,143         Root MSE        =     0.0595

                                      (Std. err. adjusted for 4,143 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
d_average_interest_~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0012375   .0004777     2.59   0.010      .000301    .0021741
                      |
   c.branch_density_z#|
          c.cum_d_ffr |   -.001362   .0003042    -4.48   0.000    -.0019584   -.0007656
                      |
  c.hhi_z#c.cum_d_ffr |   .0003733   .0002111     1.77   0.077    -.0000406    .0007872
                      |
        c.metro_dummy#|
          c.cum_d_ffr |   .0031847   .0005565     5.72   0.000     .0020938    .0042757
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |  -.0004766    .000452    -1.05   0.292    -.0013627    .0004096
                      |
                qdate |
                 249  |  -.0174158   .0065527    -2.66   0.008    -.0302626   -.0045689
                 250  |  -.0140157   .0068814    -2.04   0.042    -.0275068   -.0005245
                 251  |  -.0184161   .0090362    -2.04   0.042    -.0361318   -.0007004
                 252  |  -.0148919   .0079642    -1.87   0.062    -.0305061    .0007222
                 253  |  -.0098079   .0078231    -1.25   0.210    -.0251453    .0055296
                 254  |  -.0119049   .0065637    -1.81   0.070    -.0247733    .0009634
                 255  |  -.0299832   .0073315    -4.09   0.000    -.0443569   -.0156096
                      |
           qdate#c.ne |
                 248  |   .0006373   .0118397     0.05   0.957    -.0225748    .0238494
                 249  |  -.0118266   .0118573    -1.00   0.319    -.0350733      .01142
                 250  |  -.0052412   .0118755    -0.44   0.659    -.0285235    .0180412
                 251  |   -.006544   .0119094    -0.55   0.583    -.0298929    .0168049
                 252  |  -.0016685   .0135171    -0.12   0.902    -.0281693    .0248323
                 253  |  -.0222245   .0100561    -2.21   0.027    -.0419398   -.0025092
                 254  |  -.0104816   .0107228    -0.98   0.328     -.031504    .0105407
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |   .0032179   .0099193     0.32   0.746    -.0162292    .0226651
                 249  |  -.0179837   .0082886    -2.17   0.030    -.0342338   -.0017336
                 250  |    .004477   .0093929     0.48   0.634    -.0139381    .0228921
                 251  |  -.0161439   .0092968    -1.74   0.083    -.0343707    .0020829
                 252  |   .0151434   .0110033     1.38   0.169     -.006429    .0367158
                 253  |  -.0254029   .0094307    -2.69   0.007    -.0438922   -.0069137
                 254  |   .0017621   .0091685     0.19   0.848    -.0162131    .0197373
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -.0053975   .0076951    -0.70   0.483     -.020484    .0096889
                 249  |   -.018084   .0071082    -2.54   0.011    -.0320199   -.0041481
                 250  |  -.0169563   .0076709    -2.21   0.027    -.0319953   -.0019172
                 251  |  -.0223006   .0078264    -2.85   0.004    -.0376446   -.0069567
                 252  |  -.0054469   .0084625    -0.64   0.520    -.0220379    .0111442
                 253  |  -.0280818   .0077894    -3.61   0.000    -.0433533   -.0128104
                 254  |  -.0114518   .0071028    -1.61   0.107    -.0253772    .0024735
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0080518   .0076827    -1.05   0.295     -.023114    .0070104
                 249  |  -.0262785   .0069861    -3.76   0.000    -.0399751   -.0125819
                 250  |  -.0388769   .0075681    -5.14   0.000    -.0537145   -.0240394
                 251  |  -.0258425   .0077681    -3.33   0.001    -.0410721   -.0106128
                 252  |   -.012511   .0084098    -1.49   0.137    -.0289988    .0039767
                 253  |  -.0431905   .0076042    -5.68   0.000    -.0580988   -.0282823
                 254  |  -.0327729   .0069651    -4.71   0.000    -.0464282   -.0191175
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0149118   .0083598    -1.78   0.075    -.0313014    .0014778
                 249  |  -.0245665   .0077701    -3.16   0.002       -.0398    -.009333
                 250  |  -.0316071   .0084596    -3.74   0.000    -.0481925   -.0150218
                 251  |  -.0149789   .0086629    -1.73   0.084    -.0319628    .0020051
                 252  |    -.01898    .009524    -1.99   0.046    -.0376522   -.0003079
                 253  |  -.0318364   .0082793    -3.85   0.000    -.0480683   -.0156044
                 254  |  -.0300691   .0076567    -3.93   0.000    -.0450804   -.0150578
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0200114   .0084165    -2.38   0.017    -.0365123   -.0035104
                 249  |  -.0332109   .0076962    -4.32   0.000    -.0482996   -.0181223
                 250  |  -.0422269   .0081326    -5.19   0.000    -.0581711   -.0262826
                 251  |  -.0228429   .0082124    -2.78   0.005    -.0389436   -.0067422
                 252  |  -.0189372   .0089271    -2.12   0.034    -.0364391   -.0014353
                 253  |  -.0437912   .0079697    -5.49   0.000    -.0594161   -.0281662
                 254  |  -.0257046   .0074787    -3.44   0.001    -.0403669   -.0110422
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |  -.0269812    .008219    -3.28   0.001    -.0430948   -.0108677
                 249  |  -.0417598   .0075727    -5.51   0.000    -.0566063   -.0269132
                 250  |  -.0445404   .0079726    -5.59   0.000     -.060171   -.0289098
                 251  |  -.0263455   .0080582    -3.27   0.001     -.042144   -.0105471
                 252  |  -.0234443   .0088267    -2.66   0.008    -.0407494   -.0061392
                 253  |  -.0513111   .0079829    -6.43   0.000    -.0669618   -.0356604
                 254  |  -.0346599   .0073381    -4.72   0.000    -.0490466   -.0202733
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |  -.0162867   .0106617    -1.53   0.127    -.0371894     .004616
                 249  |  -.0158605   .0096445    -1.64   0.100    -.0347689     .003048
                 250  |  -.0217194   .0096927    -2.24   0.025    -.0407224   -.0027164
                 251  |  -.0347374   .0106368    -3.27   0.001    -.0555911   -.0138836
                 252  |  -.0299559   .0109414    -2.74   0.006     -.051407   -.0085048
                 253  |  -.0277301    .010192    -2.72   0.007    -.0477119   -.0077483
                 254  |  -.0155388   .0097655    -1.59   0.112    -.0346845    .0036068
                 255  |          0  (omitted)
                      |
                _cons |    .042793   .0070648     6.06   0.000     .0289421    .0566439
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      4143        4143           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  4142) =   10.77
            Prob > F =    0.0000

. 
. * 2h) Deposit quantity (cum change): average deposits
. reghdfe cum_d_average_deposit ///
>         c.sophistication_index#c.cum_d_ffr ///
>                 c.branch_density_z#c.cum_d_ffr ///
>                 c.hhi_z#c.cum_d_ffr ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)
note: 255.qdate#c.ne omitted because of collinearity
note: 255.qdate#c.ma omitted because of collinearity
note: 255.qdate#c.ec omitted because of collinearity
note: 255.qdate#c.wc omitted because of collinearity
note: 255.qdate#c.sa omitted because of collinearity
note: 255.qdate#c.es omitted because of collinearity
note: 255.qdate#c.ws omitted because of collinearity
note: 255.qdate#c.mt omitted because of collinearity

HDFE Linear regression                            Number of obs   =     28,822
Absorbing 1 HDFE group                            F(  68,   3819) =      13.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7307
                                                  Adj R-squared   =     0.6887
                                                  Within R-sq.    =     0.0493
Number of clusters (bankid)  =      3,820         Root MSE        =     0.0571

                                      (Std. err. adjusted for 3,820 clusters in bankid)
---------------------------------------------------------------------------------------
                      |               Robust
cum_d_average_deposit | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
                   c. |
sophistication_inde~z#|
          c.cum_d_ffr |   .0007815   .0009433     0.83   0.407     -.001068     .002631
                      |
   c.branch_density_z#|
          c.cum_d_ffr |  -.0041208   .0006322    -6.52   0.000    -.0053604   -.0028813
                      |
  c.hhi_z#c.cum_d_ffr |  -.0001711   .0004104    -0.42   0.677    -.0009758    .0006336
                      |
        c.metro_dummy#|
          c.cum_d_ffr |   .0031846   .0010847     2.94   0.003      .001058    .0053111
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |   -.001026   .0009045    -1.13   0.257    -.0027993    .0007473
                      |
                qdate |
                 249  |  -.0036383   .0038693    -0.94   0.347    -.0112245    .0039478
                 250  |  -.0025914   .0061984    -0.42   0.676     -.014744    .0095612
                 251  |  -.0225419   .0083625    -2.70   0.007    -.0389372   -.0061466
                 252  |   -.033621   .0102559    -3.28   0.001    -.0537286   -.0135134
                 253  |  -.0347127   .0109254    -3.18   0.001    -.0561328   -.0132925
                 254  |  -.0217731   .0114413    -1.90   0.057    -.0442049    .0006586
                 255  |  -.0366656   .0121464    -3.02   0.003    -.0604796   -.0128516
                      |
           qdate#c.ne |
                 248  |   -.046713   .0201068    -2.32   0.020    -.0861341   -.0072918
                 249  |  -.0488749   .0165297    -2.96   0.003    -.0812829    -.016467
                 250  |  -.0483021   .0151977    -3.18   0.001    -.0780986   -.0185057
                 251  |  -.0358345   .0129954    -2.76   0.006    -.0613132   -.0103558
                 252  |  -.0209065   .0112324    -1.86   0.063    -.0429285    .0011155
                 253  |  -.0202844   .0092781    -2.19   0.029     -.038475   -.0020938
                 254  |  -.0153202   .0067837    -2.26   0.024    -.0286202   -.0020203
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |  -.0381473   .0153249    -2.49   0.013    -.0681931   -.0081015
                 249  |  -.0407535   .0139507    -2.92   0.004    -.0681051   -.0134018
                 250  |  -.0298421   .0123605    -2.41   0.016    -.0540758   -.0056084
                 251  |  -.0306513   .0100199    -3.06   0.002    -.0502963   -.0110064
                 252  |  -.0051441   .0089485    -0.57   0.565    -.0226885    .0124003
                 253  |   -.011888   .0070239    -1.69   0.091    -.0256589    .0018829
                 254  |  -.0104031   .0055657    -1.87   0.062    -.0213151    .0005088
                 255  |          0  (omitted)
                      |
           qdate#c.ec |
                 248  |  -.0575078   .0126887    -4.53   0.000    -.0823852   -.0326305
                 249  |  -.0543191    .011266    -4.82   0.000    -.0764071    -.032231
                 250  |  -.0505998   .0103704    -4.88   0.000    -.0709318   -.0302677
                 251  |  -.0340657   .0079673    -4.28   0.000    -.0496863   -.0184451
                 252  |  -.0188675   .0068536    -2.75   0.006    -.0323045   -.0054305
                 253  |  -.0208028   .0054421    -3.82   0.000    -.0314725   -.0101331
                 254  |  -.0244729   .0045221    -5.41   0.000    -.0333388   -.0156069
                 255  |          0  (omitted)
                      |
           qdate#c.wc |
                 248  |  -.0537101   .0124608    -4.31   0.000    -.0781405   -.0292796
                 249  |   -.049432   .0110207    -4.49   0.000     -.071039    -.027825
                 250  |  -.0550225   .0101577    -5.42   0.000    -.0749376   -.0351074
                 251  |  -.0290597   .0077724    -3.74   0.000    -.0442982   -.0138213
                 252  |  -.0130555   .0067598    -1.93   0.054    -.0263086    .0001977
                 253  |   -.023184   .0053576    -4.33   0.000     -.033688   -.0126801
                 254  |  -.0364168   .0044716    -8.14   0.000    -.0451836   -.0276499
                 255  |          0  (omitted)
                      |
           qdate#c.sa |
                 248  |  -.0680933   .0145327    -4.69   0.000    -.0965858   -.0396007
                 249  |  -.0594119   .0129019    -4.60   0.000    -.0847072   -.0341166
                 250  |  -.0588132   .0116369    -5.05   0.000    -.0816284   -.0359981
                 251  |  -.0396747   .0090012    -4.41   0.000    -.0573222   -.0220272
                 252  |  -.0218967   .0075415    -2.90   0.004    -.0366825   -.0071109
                 253  |  -.0205317   .0059027    -3.48   0.001    -.0321046   -.0089589
                 254  |  -.0278181   .0048649    -5.72   0.000    -.0373562     -.01828
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |  -.0867956   .0142245    -6.10   0.000     -.114684   -.0589072
                 249  |  -.0735139   .0124465    -5.91   0.000    -.0979163   -.0491115
                 250  |  -.0751823   .0111376    -6.75   0.000    -.0970185   -.0533461
                 251  |  -.0524422   .0085242    -6.15   0.000    -.0691547   -.0357298
                 252  |  -.0247482   .0073141    -3.38   0.001    -.0390882   -.0104083
                 253  |  -.0269513   .0058923    -4.57   0.000    -.0385036   -.0153989
                 254  |   -.031139   .0046991    -6.63   0.000     -.040352    -.021926
                 255  |          0  (omitted)
                      |
           qdate#c.ws |
                 248  |   -.071165   .0136658    -5.21   0.000     -.097958    -.044372
                 249  |  -.0580071   .0119637    -4.85   0.000    -.0814629   -.0345513
                 250  |  -.0550356   .0108063    -5.09   0.000    -.0762222   -.0338489
                 251  |  -.0314231   .0083102    -3.78   0.000    -.0477159   -.0151303
                 252  |  -.0160681   .0071614    -2.24   0.025    -.0301087   -.0020276
                 253  |   -.021615   .0057026    -3.79   0.000    -.0327955   -.0104345
                 254  |  -.0299281   .0047552    -6.29   0.000    -.0392511    -.020605
                 255  |          0  (omitted)
                      |
           qdate#c.mt |
                 248  |  -.0509361   .0172348    -2.96   0.003    -.0847264   -.0171459
                 249  |  -.0432737   .0150608    -2.87   0.004    -.0728016   -.0137458
                 250  |  -.0311277   .0135518    -2.30   0.022    -.0576971   -.0045584
                 251  |  -.0175882   .0112276    -1.57   0.117    -.0396009    .0044244
                 252  |  -.0197714   .0097859    -2.02   0.043    -.0389575   -.0005853
                 253  |  -.0219808   .0079252    -2.77   0.006    -.0375189   -.0064428
                 254  |  -.0214825   .0067947    -3.16   0.002    -.0348041    -.008161
                 255  |          0  (omitted)
                      |
                _cons |   .0897366   .0117055     7.67   0.000      .066787    .1126862
---------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * Joint significance of {zS, zR, zH}×cum ΔFFR
. test c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d
> _ffr

 ( 1)  c.sophistication_index_z#c.cum_d_ffr = 0
 ( 2)  c.branch_density_z#c.cum_d_ffr = 0
 ( 3)  c.hhi_z#c.cum_d_ffr = 0

       F(  3,  3819) =   15.13
            Prob > F =    0.0000

. 
. *------------------------------------------------------
. * 3) Stage 2 robustness: IV effect on loan growth
. *    - Endogenous regressor variants:
. *       3a) cum_d_interest_rate_on_interest_ (pricing, levels)
. *       3b) d_average_interest_bearing_depos (quantities, first-difference)
. *       3c) cum_d_average_deposit (quantities, cum change)
. *    - Instruments: {zS, zR, zH}×cum ΔFFR
. *    - Same FE and controls as Stage 1
. *------------------------------------------------------
. * ------------------------
. /// without metro and income controls
> ivreghdfe d_total_loans_not_for_sale ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         (cum_d_interest_rate_on_deposit = c.sophistication_index#c.cum_d_ffr c.branch_
> density_z#c.cum_d_ffr c.hhi_z#c.cum_d_ffr) ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on bankid

Number of clusters (bankid) =     3820                Number of obs =    28822
                                                      F( 64,  3819) =    41.98
                                                      Prob > F      =   0.0000
Total (centered) SS     =  39.97704482                Centered R2   =   0.1178
Total (uncentered) SS   =  39.97704482                Uncentered R2 =   0.1178
Residual SS             =  35.26890511                Root MSE      =   .03502

---------------------------------------------------------------------------------------
                      |               Robust
d_total_loans_not_f~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
cum_d_interest_rate~t |   -1.06813   .2255607    -4.74   0.000    -1.510361   -.6258993
                      |
                qdate |
                 248  |          0  (empty)
                 249  |   .0300777   .0044461     6.76   0.000     .0213607    .0387946
                 250  |    .018165   .0046989     3.87   0.000     .0089524    .0273775
                 251  |   .0248794   .0045364     5.48   0.000     .0159855    .0337733
                 252  |    .008821   .0045125     1.95   0.051    -.0000261    .0176682
                 253  |   .0166329   .0052761     3.15   0.002     .0062887    .0269772
                 254  |   .0146483   .0052878     2.77   0.006     .0042812    .0250154
                 255  |   .0240625   .0057715     4.17   0.000     .0127471     .035378
                      |
           qdate#c.ne |
                 248  |          0  (omitted)
                 249  |  -.0109924   .0068621    -1.60   0.109    -.0244462    .0024614
                 250  |   .0000739   .0080624     0.01   0.993    -.0157331    .0158809
                 251  |  -.0071162   .0068465    -1.04   0.299    -.0205394    .0063069
                 252  |  -.0006989   .0065925    -0.11   0.916    -.0136241    .0122262
                 253  |  -.0050825   .0076276    -0.67   0.505     -.020037    .0098721
                 254  |   .0032436   .0066995     0.48   0.628    -.0098914    .0163785
                 255  |   -.007188   .0072155    -1.00   0.319    -.0213345    .0069585
                      |
           qdate#c.ma |
                 248  |          0  (omitted)
                 249  |  -.0125381   .0054565    -2.30   0.022     -.023236   -.0018401
                 250  |  -.0017525   .0056161    -0.31   0.755    -.0127634    .0092584
                 251  |  -.0088766   .0053985    -1.64   0.100    -.0194609    .0017077
                 252  |   .0009196   .0051563     0.18   0.858    -.0091899     .011029
                 253  |  -.0024144   .0053692    -0.45   0.653    -.0129412    .0081125
                 254  |  -.0011913     .00498    -0.24   0.811     -.010955    .0085724
                 255  |  -.0098581   .0053385    -1.85   0.065    -.0203246    .0006085
                      |
           qdate#c.ec |
                 248  |  -.0090306   .0049235    -1.83   0.067    -.0186835    .0006224
                 249  |  -.0004413   .0047183    -0.09   0.925     -.009692    .0088093
                 250  |   .0078586   .0044968     1.75   0.081    -.0009578    .0166749
                 251  |   .0017308   .0042492     0.41   0.684       -.0066    .0100617
                 252  |  -.0053005   .0036345    -1.46   0.145    -.0124262    .0018251
                 253  |   .0068306          .        .       .            .           .
                 254  |   .0069637   .0029355     2.37   0.018     .0012083     .012719
                 255  |          0     .00372     0.00   1.000    -.0072933    .0072933
                      |
           qdate#c.wc |
                 248  |  -.0012883   .0048836    -0.26   0.792    -.0108631    .0082865
                 249  |   .0107488   .0050762     2.12   0.034     .0007965    .0207011
                 250  |    .023692   .0048793     4.86   0.000     .0141257    .0332583
                 251  |   .0170212   .0039994     4.26   0.000     .0091801    .0248624
                 252  |          0   .0039695     0.00   1.000    -.0077825    .0077825
                 253  |   .0291888   .0037598     7.76   0.000     .0218174    .0365602
                 254  |    .027151   .0030282     8.97   0.000     .0212138    .0330881
                 255  |   .0211807          .        .       .            .           .
                      |
           qdate#c.sa |
                 248  |   .0048074    .005301     0.91   0.365    -.0055856    .0152004
                 249  |   .0018689   .0055139     0.34   0.735    -.0089416    .0126794
                 250  |   .0105117   .0052163     2.02   0.044     .0002848    .0207387
                 251  |   .0010728   .0045382     0.24   0.813    -.0078247    .0099703
                 252  |    .008518   .0043653     1.95   0.051    -.0000407    .0170766
                 253  |   .0074733   .0041086     1.82   0.069    -.0005821    .0155286
                 254  |   .0060303   .0033628     1.79   0.073    -.0005627    .0126233
                 255  |          0  (omitted)
                      |
           qdate#c.es |
                 248  |   -.000951   .0051962    -0.18   0.855    -.0111385    .0092365
                 249  |   -.005743    .004993    -1.15   0.250    -.0155322    .0040462
                 250  |   .0067872   .0046781     1.45   0.147    -.0023847    .0159591
                 251  |  -.0048298   .0043474    -1.11   0.267    -.0133533    .0036938
                 252  |   .0014615   .0038062     0.38   0.701    -.0060009    .0089238
                 253  |          0  (omitted)
                 254  |    .003225   .0031647     1.02   0.308    -.0029796    .0094297
                 255  |  -.0047934   .0039433    -1.22   0.224    -.0125245    .0029377
                      |
           qdate#c.ws |
                 248  |  -.0001136   .0048144    -0.02   0.981    -.0095526    .0093254
                 249  |   .0000744   .0047647     0.02   0.988    -.0092673    .0094161
                 250  |   .0066327   .0044218     1.50   0.134    -.0020367    .0153021
                 251  |          0   .0042166     0.00   1.000     -.008267     .008267
                 252  |   .0062688   .0035364     1.77   0.076    -.0006647    .0132022
                 253  |   .0088371   .0032296     2.74   0.006     .0025052     .015169
                 254  |   .0021478          .        .       .            .           .
                 255  |  -.0038528   .0033667    -1.14   0.253    -.0104534    .0027479
                      |
           qdate#c.mt |
                 248  |  -.0068666   .0062789    -1.09   0.274    -.0191769    .0054437
                 249  |  -.0040121   .0063317    -0.63   0.526    -.0164261    .0084018
                 250  |   -.004246   .0055748    -0.76   0.446    -.0151758    .0066838
                 251  |  -.0125883     .00574    -2.19   0.028     -.023842   -.0013346
                 252  |  -.0035152   .0045424    -0.77   0.439     -.012421    .0053907
                 253  |   .0095396   .0047426     2.01   0.044     .0002413    .0188378
                 254  |          0  (omitted)
                 255  |  -.0145238    .005012    -2.90   0.004    -.0243503   -.0046972
---------------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            395.375
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):             1986.503
                         (Kleibergen-Paap rk Wald F statistic):        227.846
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.91
                                         10% maximal IV relative bias     9.08
                                         20% maximal IV relative bias     6.46
                                         30% maximal IV relative bias     5.39
                                         10% maximal IV size             22.30
                                         15% maximal IV size             12.83
                                         20% maximal IV size              9.54
                                         25% maximal IV size              7.80
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Warning: estimated covariance matrix of moment conditions not of full rank.
         overidentification statistic not reported, and standard errors and
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
------------------------------------------------------------------------------
Collinearities detected among instruments: 8 instrument(s) dropped
Instrumented:         cum_d_interest_rate_on_deposit
Included instruments: 249.qdate 250.qdate 251.qdate 252.qdate 253.qdate
                      254.qdate 255.qdate 248b.qdate#c.ne 249.qdate#c.ne
                      250.qdate#c.ne 251.qdate#c.ne 252.qdate#c.ne
                      253.qdate#c.ne 254.qdate#c.ne 255.qdate#c.ne
                      248b.qdate#c.ma 249.qdate#c.ma 250.qdate#c.ma
                      251.qdate#c.ma 252.qdate#c.ma 253.qdate#c.ma
                      254.qdate#c.ma 255.qdate#c.ma 248b.qdate#c.ec
                      249.qdate#c.ec 250.qdate#c.ec 251.qdate#c.ec
                      252.qdate#c.ec 253.qdate#c.ec 254.qdate#c.ec
                      255.qdate#c.ec 248b.qdate#c.wc 249.qdate#c.wc
                      250.qdate#c.wc 251.qdate#c.wc 252.qdate#c.wc
                      253.qdate#c.wc 254.qdate#c.wc 255.qdate#c.wc
                      248b.qdate#c.sa 249.qdate#c.sa 250.qdate#c.sa
                      251.qdate#c.sa 252.qdate#c.sa 253.qdate#c.sa
                      254.qdate#c.sa 255.qdate#c.sa 248b.qdate#c.es
                      249.qdate#c.es 250.qdate#c.es 251.qdate#c.es
                      252.qdate#c.es 253.qdate#c.es 254.qdate#c.es
                      255.qdate#c.es 248b.qdate#c.ws 249.qdate#c.ws
                      250.qdate#c.ws 251.qdate#c.ws 252.qdate#c.ws
                      253.qdate#c.ws 254.qdate#c.ws 255.qdate#c.ws
                      248b.qdate#c.mt 249.qdate#c.mt 250.qdate#c.mt
                      251.qdate#c.mt 252.qdate#c.mt 253.qdate#c.mt
                      254.qdate#c.mt 255.qdate#c.mt
Excluded instruments: c.sophistication_index_z#c.cum_d_ffr
                      c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d_ffr
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. ivreghdfe d_total_loans_not_for_sale ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         (cum_d_core_deposit = c.sophistication_index#c.cum_d_ffr c.branch_density_z#c.
> cum_d_ffr c.hhi_z#c.cum_d_ffr) ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on bankid

Number of clusters (bankid) =     3820                Number of obs =    28822
                                                      F( 64,  3819) =    39.33
                                                      Prob > F      =   0.0000
Total (centered) SS     =  39.97704482                Centered R2   =  -0.0227
Total (uncentered) SS   =  39.97704482                Uncentered R2 =  -0.0227
Residual SS             =  40.88434383                Root MSE      =   .03771

------------------------------------------------------------------------------------
                   |               Robust
d_total_loans_no~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
cum_d_core_deposit |  -.2454234     .07062    -3.48   0.001    -.3838798   -.1069669
                   |
             qdate |
              248  |          0  (empty)
              249  |    .030528   .0046437     6.57   0.000     .0214236    .0396324
              250  |    .017717   .0048997     3.62   0.000     .0081107    .0273233
              251  |   .0142052   .0052191     2.72   0.007     .0039727    .0244377
              252  |   -.010752   .0056319    -1.91   0.056    -.0217939    .0002898
              253  |  -.0080277   .0062749    -1.28   0.201    -.0203302    .0042749
              254  |  -.0103529   .0056967    -1.82   0.069    -.0215218     .000816
              255  |  -.0062133   .0064365    -0.97   0.334    -.0188326    .0064061
                   |
        qdate#c.ne |
              248  |  -.0031142   .0085719    -0.36   0.716    -.0199202    .0136919
              249  |  -.0142644   .0090004    -1.58   0.113    -.0319105    .0033816
              250  |  -.0028284    .009818    -0.29   0.773    -.0220775    .0164207
              251  |  -.0059907    .007098    -0.84   0.399    -.0199069    .0079255
              252  |   .0027278   .0067294     0.41   0.685    -.0104658    .0159214
              253  |  -.0034593   .0067696    -0.51   0.609    -.0167316     .009813
              254  |   .0085571   .0053558     1.60   0.110    -.0019434    .0190577
              255  |          0  (omitted)
                   |
        qdate#c.ma |
              248  |          0  (omitted)
              249  |  -.0136125   .0058809    -2.31   0.021    -.0251425   -.0020826
              250  |  -.0010306   .0060711    -0.17   0.865    -.0129335    .0108723
              251  |   -.006258   .0063159    -0.99   0.322    -.0186409    .0061249
              252  |   .0114323   .0070546     1.62   0.105    -.0023988    .0252634
              253  |   .0082409   .0073616     1.12   0.263    -.0061921    .0226738
              254  |   .0093971   .0071357     1.32   0.188    -.0045931    .0233872
              255  |   .0030595   .0078267     0.39   0.696    -.0122854    .0184044
                   |
        qdate#c.ec |
              248  |  -.0287948   .0064192    -4.49   0.000    -.0413803   -.0162094
              249  |  -.0202575   .0057928    -3.50   0.000    -.0316148   -.0089001
              250  |  -.0113606   .0055647    -2.04   0.041    -.0222706   -.0004507
              251  |  -.0112754   .0047242    -2.39   0.017    -.0205376   -.0020132
              252  |  -.0130592   .0038965    -3.35   0.001    -.0206986   -.0054199
              253  |          0  (omitted)
              254  |  -.0008136    .003224    -0.25   0.801    -.0071347    .0055074
              255  |  -.0024889   .0042608    -0.58   0.559    -.0108426    .0058648
                   |
        qdate#c.wc |
              248  |  -.0128847   .0069021    -1.87   0.062    -.0264168    .0006474
              249  |  -.0010576   .0067078    -0.16   0.875    -.0142087    .0120936
              250  |   .0104328    .006998     1.49   0.136    -.0032873    .0241529
              251  |   .0114867   .0052017     2.21   0.027     .0012884    .0216851
              252  |          0   .0046902     0.00   1.000    -.0091954    .0091954
              253  |   .0279267    .004392     6.36   0.000     .0193158    .0365376
              254  |   .0234234   .0040534     5.78   0.000     .0154763    .0313706
              255  |   .0247874          .        .       .            .           .
                   |
        qdate#c.sa |
              248  |  -.0147893   .0079936    -1.85   0.064    -.0304614    .0008829
              249  |  -.0148524   .0072328    -2.05   0.040    -.0290328   -.0006719
              250  |  -.0048076   .0069597    -0.69   0.490    -.0184526    .0088374
              251  |   -.008339   .0056885    -1.47   0.143    -.0194917    .0028137
              252  |   .0056192   .0050797     1.11   0.269    -.0043399    .0155784
              253  |   .0053167   .0045327     1.17   0.241    -.0035701    .0142035
              254  |   .0024589   .0038196     0.64   0.520    -.0050297    .0099476
              255  |          0  (omitted)
                   |
        qdate#c.es |
              248  |  -.0191153   .0075308    -2.54   0.011    -.0338801   -.0043505
              249  |  -.0209926   .0064894    -3.23   0.001    -.0337156   -.0082696
              250  |  -.0085377   .0063976    -1.33   0.182    -.0210806    .0040053
              251  |  -.0143256   .0052587    -2.72   0.006    -.0246357   -.0040155
              252  |   .0002231    .004084     0.05   0.956    -.0077839    .0082301
              253  |          0  (omitted)
              254  |   .0026346   .0034343     0.77   0.443    -.0040987     .009368
              255  |  -.0000928   .0046111    -0.02   0.984    -.0091332    .0089477
                   |
        qdate#c.ws |
              248  |  -.0153708   .0065311    -2.35   0.019    -.0281756    -.002566
              249  |  -.0122943   .0056136    -2.19   0.029    -.0233002   -.0012884
              250  |  -.0045779   .0052683    -0.87   0.385    -.0149069    .0057511
              251  |  -.0045555   .0046872    -0.97   0.331    -.0137451    .0046341
              252  |   .0060307   .0040818     1.48   0.140     -.001972    .0140335
              253  |   .0081149    .003496     2.32   0.020     .0012606    .0149691
              254  |          0  (omitted)
              255  |  -.0014819   .0038983    -0.38   0.704    -.0091249    .0061611
                   |
        qdate#c.mt |
              248  |  -.0212198   .0080397    -2.64   0.008    -.0369824   -.0054573
              249  |  -.0175477   .0076759    -2.29   0.022     -.032597   -.0024984
              250  |   -.013455   .0065382    -2.06   0.040    -.0262737   -.0006362
              251  |  -.0161991   .0065351    -2.48   0.013    -.0290117   -.0033864
              252  |  -.0043026   .0051093    -0.84   0.400    -.0143199    .0057147
              253  |   .0081781   .0050649     1.61   0.106     -.001752    .0181082
              254  |          0  (omitted)
              255  |  -.0109274   .0054475    -2.01   0.045    -.0216077   -.0002472
------------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             28.168
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               56.149
                         (Kleibergen-Paap rk Wald F statistic):          9.806
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.91
                                         10% maximal IV relative bias     9.08
                                         20% maximal IV relative bias     6.46
                                         30% maximal IV relative bias     5.39
                                         10% maximal IV size             22.30
                                         15% maximal IV size             12.83
                                         20% maximal IV size              9.54
                                         25% maximal IV size              7.80
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Warning: estimated covariance matrix of moment conditions not of full rank.
         overidentification statistic not reported, and standard errors and
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
------------------------------------------------------------------------------
Collinearities detected among instruments: 8 instrument(s) dropped
Instrumented:         cum_d_core_deposit
Included instruments: 249.qdate 250.qdate 251.qdate 252.qdate 253.qdate
                      254.qdate 255.qdate 248b.qdate#c.ne 249.qdate#c.ne
                      250.qdate#c.ne 251.qdate#c.ne 252.qdate#c.ne
                      253.qdate#c.ne 254.qdate#c.ne 255.qdate#c.ne
                      248b.qdate#c.ma 249.qdate#c.ma 250.qdate#c.ma
                      251.qdate#c.ma 252.qdate#c.ma 253.qdate#c.ma
                      254.qdate#c.ma 255.qdate#c.ma 248b.qdate#c.ec
                      249.qdate#c.ec 250.qdate#c.ec 251.qdate#c.ec
                      252.qdate#c.ec 253.qdate#c.ec 254.qdate#c.ec
                      255.qdate#c.ec 248b.qdate#c.wc 249.qdate#c.wc
                      250.qdate#c.wc 251.qdate#c.wc 252.qdate#c.wc
                      253.qdate#c.wc 254.qdate#c.wc 255.qdate#c.wc
                      248b.qdate#c.sa 249.qdate#c.sa 250.qdate#c.sa
                      251.qdate#c.sa 252.qdate#c.sa 253.qdate#c.sa
                      254.qdate#c.sa 255.qdate#c.sa 248b.qdate#c.es
                      249.qdate#c.es 250.qdate#c.es 251.qdate#c.es
                      252.qdate#c.es 253.qdate#c.es 254.qdate#c.es
                      255.qdate#c.es 248b.qdate#c.ws 249.qdate#c.ws
                      250.qdate#c.ws 251.qdate#c.ws 252.qdate#c.ws
                      253.qdate#c.ws 254.qdate#c.ws 255.qdate#c.ws
                      248b.qdate#c.mt 249.qdate#c.mt 250.qdate#c.mt
                      251.qdate#c.mt 252.qdate#c.mt 253.qdate#c.mt
                      254.qdate#c.mt 255.qdate#c.mt
Excluded instruments: c.sophistication_index_z#c.cum_d_ffr
                      c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d_ffr
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. * 3c) Quantities (cum change): instrument cum_d_average_deposit
. ivreghdfe d_total_loans_not_for_sale ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         (cum_d_average_deposit = c.sophistication_index#c.cum_d_ffr c.branch_density_z
> #c.cum_d_ffr c.hhi_z#c.cum_d_ffr) ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on bankid

Number of clusters (bankid) =     3820                Number of obs =    28822
                                                      F( 66,  3819) =    44.80
                                                      Prob > F      =   0.0000
Total (centered) SS     =  39.97704482                Centered R2   =   0.0894
Total (uncentered) SS   =  39.97704482                Uncentered R2 =   0.0894
Residual SS             =  36.40177621                Root MSE      =   .03558

---------------------------------------------------------------------------------------
                      |               Robust
d_total_loans_not_f~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
cum_d_average_deposit |  -.1435355   .0531427    -2.70   0.007    -.2477263   -.0393447
                      |
        c.metro_dummy#|
          c.cum_d_ffr |  -.0011366    .000487    -2.33   0.020    -.0020915   -.0001817
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |   .0000437   .0002169     0.20   0.840    -.0003815    .0004689
                      |
                qdate |
                 248  |          0  (empty)
                 249  |   .0316486    .004493     7.04   0.000     .0228397    .0404576
                 250  |   .0211235    .004828     4.38   0.000     .0116577    .0305893
                 251  |   .0238607    .004898     4.87   0.000     .0142578    .0334637
                 252  |   .0032372   .0047363     0.68   0.494    -.0060488    .0125232
                 253  |   .0074696    .005107     1.46   0.144     -.002543    .0174822
                 254  |   .0049775   .0046811     1.06   0.288    -.0042002    .0141551
                 255  |    .010533   .0051068     2.06   0.039     .0005206    .0205454
                      |
           qdate#c.ne |
                 248  |   .0030673   .0073633     0.42   0.677    -.0113691    .0175037
                 249  |  -.0085851   .0078549    -1.09   0.274    -.0239853    .0068151
                 250  |   .0022858   .0088837     0.26   0.797    -.0151315    .0197031
                 251  |   -.002994   .0062874    -0.48   0.634    -.0153209     .009333
                 252  |   .0047637   .0057363     0.83   0.406    -.0064827    .0160102
                 253  |  -.0002076   .0059156    -0.04   0.972    -.0118057    .0113905
                 254  |   .0087376   .0050382     1.73   0.083    -.0011402    .0186153
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |   .0011216   .0057137     0.20   0.844    -.0100805    .0123237
                 249  |   -.012338   .0052887    -2.33   0.020    -.0227071    -.001969
                 250  |  -.0011492   .0047939    -0.24   0.811    -.0105481    .0082496
                 251  |  -.0090794          .        .       .            .           .
                 252  |   .0040367   .0044736     0.90   0.367    -.0047342    .0128076
                 253  |          0   .0048114     0.00   1.000    -.0094331    .0094331
                 254  |   .0015659   .0046467     0.34   0.736    -.0075444    .0106762
                 255  |    -.00601   .0049769    -1.21   0.227    -.0157676    .0037476
                      |
           qdate#c.ec |
                 248  |  -.0186881   .0050061    -3.73   0.000    -.0285029   -.0088732
                 249  |  -.0108457    .004753    -2.28   0.023    -.0201644   -.0015269
                 250  |  -.0031501   .0043932    -0.72   0.473    -.0117634    .0054631
                 251  |  -.0073031   .0038846    -1.88   0.060    -.0149192     .000313
                 252  |  -.0119806   .0035542    -3.37   0.001     -.018949   -.0050123
                 253  |   .0003687   .0029851     0.12   0.902    -.0054839    .0062213
                 254  |          0  (omitted)
                 255  |  -.0038191   .0032971    -1.16   0.247    -.0102834    .0026451
                      |
           qdate#c.wc |
                 248  |  -.0031504   .0048387    -0.65   0.515    -.0126371    .0063362
                 249  |   .0079012   .0044039     1.79   0.073    -.0007331    .0165355
                 250  |   .0184348   .0041752     4.42   0.000      .010249    .0266207
                 251  |    .014571   .0039116     3.73   0.000      .006902      .02224
                 252  |          0    .003764     0.00   1.000    -.0073797    .0073797
                 253  |   .0281843   .0030512     9.24   0.000     .0222023    .0341664
                 254  |   .0239016          .        .       .            .           .
                 255  |   .0226723   .0036673     6.18   0.000     .0154824    .0298623
                      |
           qdate#c.sa |
                 248  |  -.0086793   .0059122    -1.47   0.142    -.0202706    .0029121
                 249  |  -.0110273   .0053763    -2.05   0.040    -.0215681   -.0004866
                 250  |  -.0028559   .0051065    -0.56   0.576    -.0128676    .0071559
                 251  |  -.0095489   .0046497    -2.05   0.040     -.018665   -.0004327
                 252  |   .0008173   .0038893     0.21   0.834    -.0068081    .0084426
                 253  |          0  (omitted)
                 254  |   -.002684   .0032505    -0.83   0.409    -.0090568    .0036888
                 255  |  -.0050783   .0043728    -1.16   0.246    -.0136516     .003495
                      |
           qdate#c.es |
                 248  |  -.0084512          .        .       .            .           .
                 249  |  -.0125597    .005276    -2.38   0.017    -.0229038   -.0022155
                 250  |  -.0015868   .0054547    -0.29   0.771    -.0122812    .0091075
                 251  |    -.01057   .0057215    -1.85   0.065    -.0217876    .0006476
                 252  |  -.0006732   .0058998    -0.11   0.909    -.0122403     .010894
                 253  |  -.0021441   .0060931    -0.35   0.725    -.0140901    .0098019
                 254  |          0   .0058647     0.00   1.000    -.0114983    .0114983
                 255  |  -.0042318   .0068529    -0.62   0.537    -.0176674    .0092038
                      |
           qdate#c.ws |
                 248  |  -.0026005    .005652    -0.46   0.645    -.0136818    .0084808
                 249  |  -.0018797   .0053666    -0.35   0.726    -.0124014    .0086421
                 250  |   .0037939   .0049626     0.76   0.445    -.0059358    .0135236
                 251  |          0  (omitted)
                 252  |   .0083361   .0041835     1.99   0.046      .000134    .0165382
                 253  |    .010312   .0046999     2.19   0.028     .0010974    .0195266
                 254  |   .0021901   .0042237     0.52   0.604    -.0060908     .010471
                 255  |  -.0000339    .004659    -0.01   0.994    -.0091682    .0091005
                      |
           qdate#c.mt |
                 248  |  -.0030863   .0067972    -0.45   0.650    -.0164127    .0102402
                 249  |          0  (omitted)
                 250  |   .0005195   .0063944     0.08   0.935    -.0120173    .0130563
                 251  |  -.0060516   .0072103    -0.84   0.401    -.0201879    .0080847
                 252  |   .0034851   .0069462     0.50   0.616    -.0101334    .0171037
                 253  |   .0164968   .0070301     2.35   0.019     .0027136      .03028
                 254  |   .0071229   .0066545     1.07   0.285    -.0059237    .0201696
                 255  |  -.0044003   .0079957    -0.55   0.582    -.0200766     .011276
---------------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             45.541
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               96.981
                         (Kleibergen-Paap rk Wald F statistic):         15.125
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.91
                                         10% maximal IV relative bias     9.08
                                         20% maximal IV relative bias     6.46
                                         30% maximal IV relative bias     5.39
                                         10% maximal IV size             22.30
                                         15% maximal IV size             12.83
                                         20% maximal IV size              9.54
                                         25% maximal IV size              7.80
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Warning: estimated covariance matrix of moment conditions not of full rank.
         overidentification statistic not reported, and standard errors and
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
------------------------------------------------------------------------------
Collinearities detected among instruments: 8 instrument(s) dropped
Instrumented:         cum_d_average_deposit
Included instruments: c.metro_dummy#c.cum_d_ffr
                      c.log_median_hh_income_z#c.cum_d_ffr 249.qdate 250.qdate
                      251.qdate 252.qdate 253.qdate 254.qdate 255.qdate
                      248b.qdate#c.ne 249.qdate#c.ne 250.qdate#c.ne
                      251.qdate#c.ne 252.qdate#c.ne 253.qdate#c.ne
                      254.qdate#c.ne 255.qdate#c.ne 248b.qdate#c.ma
                      249.qdate#c.ma 250.qdate#c.ma 251.qdate#c.ma
                      252.qdate#c.ma 253.qdate#c.ma 254.qdate#c.ma
                      255.qdate#c.ma 248b.qdate#c.ec 249.qdate#c.ec
                      250.qdate#c.ec 251.qdate#c.ec 252.qdate#c.ec
                      253.qdate#c.ec 254.qdate#c.ec 255.qdate#c.ec
                      248b.qdate#c.wc 249.qdate#c.wc 250.qdate#c.wc
                      251.qdate#c.wc 252.qdate#c.wc 253.qdate#c.wc
                      254.qdate#c.wc 255.qdate#c.wc 248b.qdate#c.sa
                      249.qdate#c.sa 250.qdate#c.sa 251.qdate#c.sa
                      252.qdate#c.sa 253.qdate#c.sa 254.qdate#c.sa
                      255.qdate#c.sa 248b.qdate#c.es 249.qdate#c.es
                      250.qdate#c.es 251.qdate#c.es 252.qdate#c.es
                      253.qdate#c.es 254.qdate#c.es 255.qdate#c.es
                      248b.qdate#c.ws 249.qdate#c.ws 250.qdate#c.ws
                      251.qdate#c.ws 252.qdate#c.ws 253.qdate#c.ws
                      254.qdate#c.ws 255.qdate#c.ws 248b.qdate#c.mt
                      249.qdate#c.mt 250.qdate#c.mt 251.qdate#c.mt
                      252.qdate#c.mt 253.qdate#c.mt 254.qdate#c.mt
                      255.qdate#c.mt
Excluded instruments: c.sophistication_index_z#c.cum_d_ffr
                      c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d_ffr
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. ivreghdfe d_total_loans_not_for_sale ///
>                 c.metro_dummy#c.cum_d_ffr ///
>                 c.log_median_hh_income_z#c.cum_d_ffr ///
>         i.qdate ///
>         c.ne#i.qdate c.ma#i.qdate c.ec#i.qdate c.wc#i.qdate ///
>         c.sa#i.qdate c.es#i.qdate c.ws#i.qdate c.mt#i.qdate ///
>         (cum_d_average_interest_bearing_d = c.sophistication_index#c.cum_d_ffr c.branc
> h_density_z#c.cum_d_ffr c.hhi_z#c.cum_d_ffr) ///
>         , ///
>         absorb(bankid) ///
>         cluster(bankid)
(dropped 29 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on bankid

Number of clusters (bankid) =     3820                Number of obs =    28822
                                                      F( 66,  3819) =    36.68
                                                      Prob > F      =   0.0000
Total (centered) SS     =  39.97704482                Centered R2   =   0.1000
Total (uncentered) SS   =  39.97704482                Uncentered R2 =   0.1000
Residual SS             =  35.97788924                Root MSE      =   .03537

---------------------------------------------------------------------------------------
                      |               Robust
d_total_loans_not_f~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
cum_d_average_inter~d |  -.0893986   .0303435    -2.95   0.003    -.1488896   -.0299077
                      |
        c.metro_dummy#|
          c.cum_d_ffr |  -.0009311   .0005094    -1.83   0.068    -.0019299    .0000676
                      |
                   c. |
log_median_hh_incom~z#|
          c.cum_d_ffr |   .0002088   .0002269     0.92   0.358    -.0002361    .0006537
                      |
                qdate |
                 248  |          0  (empty)
                 249  |    .031094    .004481     6.94   0.000     .0223085    .0398794
                 250  |   .0188383   .0047738     3.95   0.000     .0094789    .0281976
                 251  |   .0242652   .0047916     5.06   0.000     .0148707    .0336596
                 252  |   .0059895   .0044761     1.34   0.181    -.0027863    .0147653
                 253  |   .0123097   .0048929     2.52   0.012     .0027168    .0219026
                 254  |    .009832   .0046692     2.11   0.035     .0006778    .0189863
                 255  |   .0173166   .0049963     3.47   0.001     .0075211    .0271122
                      |
           qdate#c.ne |
                 248  |   .0088227   .0073123     1.21   0.228    -.0055137    .0231591
                 249  |  -.0032051   .0075884    -0.42   0.673    -.0180828    .0116726
                 250  |   .0087856   .0085175     1.03   0.302    -.0079136    .0254849
                 251  |   .0015147   .0061937     0.24   0.807    -.0106286     .013658
                 252  |   .0085401    .005703     1.50   0.134    -.0026412    .0197214
                 253  |   .0018063   .0057664     0.31   0.754    -.0094992    .0131118
                 254  |    .009928   .0049777     1.99   0.046     .0001688    .0196871
                 255  |          0  (omitted)
                      |
           qdate#c.ma |
                 248  |   .0046455   .0056377     0.82   0.410    -.0064078    .0156988
                 249  |  -.0089213    .005376    -1.66   0.097    -.0194614    .0016189
                 250  |   .0028011   .0051674     0.54   0.588      -.00733    .0129322
                 251  |  -.0061976   .0047485    -1.31   0.192    -.0155074    .0031121
                 252  |   .0051996   .0041761     1.25   0.213    -.0029879    .0133872
                 253  |          0  (omitted)
                 254  |   .0012167   .0033587     0.36   0.717    -.0053683    .0078017
                 255  |  -.0071393   .0041736    -1.71   0.087     -.015322    .0010434
                      |
           qdate#c.ec |
                 248  |  -.0154049   .0050916    -3.03   0.002    -.0253874   -.0054225
                 249  |  -.0071372   .0046446    -1.54   0.124    -.0162434    .0019689
                 250  |   .0016892   .0044415     0.38   0.704    -.0070187    .0103971
                 251  |  -.0050702   .0042267    -1.20   0.230    -.0133569    .0032165
                 252  |  -.0109756   .0038165    -2.88   0.004    -.0184581    -.003493
                 253  |          0  (omitted)
                 254  |   -.000146   .0030016    -0.05   0.961     -.006031    .0057389
                 255  |   -.006199   .0038444    -1.61   0.107    -.0137363    .0013383
                      |
           qdate#c.wc |
                 248  |  -.0244758    .004819    -5.08   0.000    -.0339239   -.0150277
                 249  |  -.0129932   .0044522    -2.92   0.004    -.0217222   -.0042642
                 250  |  -.0008071   .0041352    -0.20   0.845    -.0089145    .0073002
                 251  |  -.0079888   .0040539    -1.97   0.049    -.0159367   -.0000408
                 252  |  -.0237226     .00381    -6.23   0.000    -.0311923   -.0162528
                 253  |   .0036484   .0030258     1.21   0.228    -.0022839    .0095806
                 254  |          0  (omitted)
                 255  |  -.0043595   .0031974    -1.36   0.173    -.0106282    .0019092
                      |
           qdate#c.sa |
                 248  |   .0007223   .0054873     0.13   0.895    -.0100359    .0114805
                 249  |  -.0020089   .0050868    -0.39   0.693     -.011982    .0079642
                 250  |   .0074054   .0046917     1.58   0.115    -.0017931     .016604
                 251  |  -.0010728   .0045579    -0.24   0.814    -.0100089    .0078633
                 252  |   .0076876   .0039389     1.95   0.051    -.0000349    .0154101
                 253  |   .0057255          .        .       .            .           .
                 254  |   .0038878   .0032424     1.20   0.231    -.0024691    .0102448
                 255  |          0   .0043162     0.00   1.000    -.0084623    .0084623
                      |
           qdate#c.es |
                 248  |  -.0044336   .0053693    -0.83   0.409    -.0149606    .0060933
                 249  |  -.0089889   .0050038    -1.80   0.073    -.0187993    .0008215
                 250  |   .0036584   .0045456     0.80   0.421    -.0052536    .0125703
                 251  |   -.006814   .0041492    -1.64   0.101    -.0149489    .0013209
                 252  |   .0002505   .0039069     0.06   0.949    -.0074092    .0079103
                 253  |  -.0025236   .0032334    -0.78   0.435    -.0088629    .0038157
                 254  |          0  (omitted)
                 255  |  -.0061248   .0035184    -1.74   0.082    -.0130229    .0007734
                      |
           qdate#c.ws |
                 248  |  -.0083788   .0054253    -1.54   0.123    -.0190154    .0022579
                 249  |  -.0083271   .0052645    -1.58   0.114    -.0186486    .0019943
                 250  |  -.0017928   .0048275    -0.37   0.710    -.0112575    .0076718
                 251  |  -.0076097          .        .       .            .           .
                 252  |          0   .0041551     0.00   1.000    -.0081465    .0081465
                 253  |   .0011388   .0046779     0.24   0.808    -.0080326    .0103102
                 254  |  -.0065159    .004289    -1.52   0.129    -.0149249    .0018932
                 255  |  -.0102476   .0044354    -2.31   0.021    -.0189435   -.0015516
                      |
           qdate#c.mt |
                 248  |  -.0032633   .0067781    -0.48   0.630    -.0165523    .0100257
                 249  |          0  (omitted)
                 250  |   .0004134    .006369     0.06   0.948    -.0120736    .0129004
                 251  |  -.0086765   .0070297    -1.23   0.217    -.0224589    .0051058
                 252  |   .0008359   .0067141     0.12   0.901    -.0123277    .0139994
                 253  |   .0136651   .0067549     2.02   0.043     .0004216    .0269087
                 254  |   .0042201   .0064064     0.66   0.510    -.0083402    .0167803
                 255  |  -.0090067   .0076429    -1.18   0.239    -.0239914    .0059779
---------------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             79.337
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              155.473
                         (Kleibergen-Paap rk Wald F statistic):         23.935
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.91
                                         10% maximal IV relative bias     9.08
                                         20% maximal IV relative bias     6.46
                                         30% maximal IV relative bias     5.39
                                         10% maximal IV size             22.30
                                         15% maximal IV size             12.83
                                         20% maximal IV size              9.54
                                         25% maximal IV size              7.80
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Warning: estimated covariance matrix of moment conditions not of full rank.
         overidentification statistic not reported, and standard errors and
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
------------------------------------------------------------------------------
Collinearities detected among instruments: 8 instrument(s) dropped
Instrumented:         cum_d_average_interest_bearing_d
Included instruments: c.metro_dummy#c.cum_d_ffr
                      c.log_median_hh_income_z#c.cum_d_ffr 249.qdate 250.qdate
                      251.qdate 252.qdate 253.qdate 254.qdate 255.qdate
                      248b.qdate#c.ne 249.qdate#c.ne 250.qdate#c.ne
                      251.qdate#c.ne 252.qdate#c.ne 253.qdate#c.ne
                      254.qdate#c.ne 255.qdate#c.ne 248b.qdate#c.ma
                      249.qdate#c.ma 250.qdate#c.ma 251.qdate#c.ma
                      252.qdate#c.ma 253.qdate#c.ma 254.qdate#c.ma
                      255.qdate#c.ma 248b.qdate#c.ec 249.qdate#c.ec
                      250.qdate#c.ec 251.qdate#c.ec 252.qdate#c.ec
                      253.qdate#c.ec 254.qdate#c.ec 255.qdate#c.ec
                      248b.qdate#c.wc 249.qdate#c.wc 250.qdate#c.wc
                      251.qdate#c.wc 252.qdate#c.wc 253.qdate#c.wc
                      254.qdate#c.wc 255.qdate#c.wc 248b.qdate#c.sa
                      249.qdate#c.sa 250.qdate#c.sa 251.qdate#c.sa
                      252.qdate#c.sa 253.qdate#c.sa 254.qdate#c.sa
                      255.qdate#c.sa 248b.qdate#c.es 249.qdate#c.es
                      250.qdate#c.es 251.qdate#c.es 252.qdate#c.es
                      253.qdate#c.es 254.qdate#c.es 255.qdate#c.es
                      248b.qdate#c.ws 249.qdate#c.ws 250.qdate#c.ws
                      251.qdate#c.ws 252.qdate#c.ws 253.qdate#c.ws
                      254.qdate#c.ws 255.qdate#c.ws 248b.qdate#c.mt
                      249.qdate#c.mt 250.qdate#c.mt 251.qdate#c.mt
                      252.qdate#c.mt 253.qdate#c.mt 254.qdate#c.mt
                      255.qdate#c.mt
Excluded instruments: c.sophistication_index_z#c.cum_d_ffr
                      c.branch_density_z#c.cum_d_ffr c.hhi_z#c.cum_d_ffr
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
      bankid |      3820        3820           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. 
. *------------------------------------------------------
. * End — close log
. log close combined
      name:  combined
       log:  C:\Users\CHENY\Documents\GitHub\thesis-bank/results/robustness_results.log
  log type:  text
 closed on:  18 Dec 2025, 17:50:44
----------------------------------------------------------------------------------------
